{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "miedo_ansiedad",
    "1": "tristeza",
    "2": "enojo_frustracion",
    "3": "culpa_verguenza",
    "4": "negacion_incredulidad",
    "5": "agotamiento_desesperanza",
    "6": "soledad_aislamiento",
    "7": "confusion_incertidumbre",
    "8": "preocupacion_familiar",
    "9": "resignacion",
    "10": "gratitud",
    "11": "esperanza_motivacion",
    "12": "orgullo",
    "13": "alivio",
    "14": "entusiasmo",
    "15": "alegria"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "agotamiento_desesperanza": 5,
    "alegria": 15,
    "alivio": 13,
    "confusion_incertidumbre": 7,
    "culpa_verguenza": 3,
    "enojo_frustracion": 2,
    "entusiasmo": 14,
    "esperanza_motivacion": 11,
    "gratitud": 10,
    "miedo_ansiedad": 0,
    "negacion_incredulidad": 4,
    "orgullo": 12,
    "preocupacion_familiar": 8,
    "resignacion": 9,
    "soledad_aislamiento": 6,
    "tristeza": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31002
}
